================================================================================
defun full
================================================================================

(defun add (x y)
  (declare (number x) (number y))
  (declare (number y))
  "add 2 numbers"
  (+ x y))

--------------------------------------------------------------------------------

(source
  (defun (fn_name (symbol)) (lambda_list (symbol) (symbol))
    (declare (list (symbol) (symbol)) (list (symbol) (symbol)))
    (declare (list (symbol) (symbol)))
    (documentation)
    (list (symbol) (symbol) (symbol)))
  )


================================================================================
defun - single string in body
================================================================================

(defun msg ()
  "add 2 numbers")

--------------------------------------------------------------------------------

(source
  (defun (fn_name (symbol)) (lambda_list)
    (string))
  )

================================================================================
defun - empty body
================================================================================

(defun nothing ())

--------------------------------------------------------------------------------

(source
  (defun (fn_name (symbol)) (lambda_list))
  )

================================================================================
defun - body starts with non-string
================================================================================

(defun two () 1 2)

--------------------------------------------------------------------------------

(source
  (defun (fn_name (symbol)) (lambda_list) 
    (number)
    (number))
  )

================================================================================
defun - documented with body
================================================================================

(defun doit () 
  "does something"
  (something)
  'done)

--------------------------------------------------------------------------------

(source
  (defun (fn_name (symbol)) (lambda_list) 
    (documentation)
    (list (symbol))
    (quote (symbol)))
  )

================================================================================
defun - (setf fn)
================================================================================

(defun (setf f) (v x) 
  v)

--------------------------------------------------------------------------------

(source
  (defun (fn_name (symbol)) (lambda_list (symbol) (symbol)) 
    (symbol)))
