================================================================================
let simple
================================================================================

(let ((x 1) (y 2)) (+ x y))

--------------------------------------------------------------------------------

(source
  (let (let_binds (let_bind var: (symbol) init: (number))
                  (let_bind var: (symbol) init: (number)))
    (list (symbol) (symbol) (symbol)))
  )

================================================================================
let*
================================================================================

(let* ((x 1) (y 2)) (+ x y))

--------------------------------------------------------------------------------

(source
  (let (let_binds (let_bind var: (symbol) init: (number))
                  (let_bind var: (symbol) init: (number)))
    (list (symbol) (symbol) (symbol)))
  )

================================================================================
let - empty bindings
================================================================================

(let () 1)

--------------------------------------------------------------------------------

(source
  (let (let_binds) (number))
  )

================================================================================
let - bound vars with no init-form
================================================================================

(let (x y) (list x y))

--------------------------------------------------------------------------------

(source
  (let (let_binds (let_bind var: (symbol)) 
                  (let_bind var: (symbol)))
    (list (symbol) (symbol) (symbol)))
  )

================================================================================
let - mixed bound vars (with and without init-form)
================================================================================

(let (x (y 1)) (list x y))

--------------------------------------------------------------------------------

(source
  (let (let_binds (let_bind var: (symbol)) 
                  (let_bind var: (symbol) init: (number)))
    (list (symbol) (symbol) (symbol)))
  )

