================================================================================
character
================================================================================

#\a
#\1
#\abc
#\a bc
#\(

--------------------------------------------------------------------------------

(source
 (character)
 (character)
 (character)
 (character) (symbol)
 (character)
)

================================================================================
function
================================================================================

#'+
#'car
#'123
#'()
#'(a b)

--------------------------------------------------------------------------------

(source
 (function (symbol))
 (function (symbol))
 (function (number))
 (function (list))
 (function (list (symbol) (symbol)))
)

================================================================================
vector
================================================================================

#()
#0()
#(a b)
#1(a b)
#10(a b)
#10()

--------------------------------------------------------------------------------

(source
 (vector)
 (vector len: (number))
 (vector (symbol) (symbol))
 (vector len: (number) (symbol) (symbol))
 (vector len: (number) (symbol) (symbol))
 (vector len: (number))
)

================================================================================
bit vector
================================================================================

#*
#0*
#1*0
#1*01
#44*
#44*10101010

--------------------------------------------------------------------------------

(source
 (bitvector)
 (bitvector len: (number))
 (bitvector len: (number) (bits))
 (bitvector len: (number) (bits))
 (bitvector len: (number))
 (bitvector len: (number) (bits))
)

===============================================================================
uninterned symbol
================================================================================

#:abc
#:123
#:find-if

--------------------------------------------------------------------------------

(source
 (uninterned_symbol (symbol))
 (uninterned_symbol (symbol))
 (uninterned_symbol (symbol))
)

===============================================================================
sharpsign dot
================================================================================

#.123
#.abc
#.(+ 1 2)
#.#.1

--------------------------------------------------------------------------------

(source
 (sharp_dot (number))
 (sharp_dot (symbol))
 (sharp_dot (list (symbol) (number) (number)))
 (sharp_dot (sharp_dot (number)))
)

===============================================================================
complex
================================================================================

#C(3.0s1 2.0s-1)
#C(5 -3)
#C(5/3 7.0)
#C(0 1) 
--------------------------------------------------------------------------------

(source
 (complex (number) (number))
 (complex (number) (number))
 (complex (number) (number))
 (complex (number) (number))
)

===============================================================================
array
================================================================================

#2A((0 1) (foo (bar)))
#1A((0 1) (foo (bar)))
#0A((0 1) (foo (bar)))
#0A foo
#0a (foo)
#44a(0)
--------------------------------------------------------------------------------

(source
 (array (list (number) (number)) (list (symbol) (list (symbol))))
 (array (list (number) (number)) (list (symbol) (list (symbol))))
 (array (list (list (number) (number)) (list (symbol) (list (symbol)))))
 (array (symbol))
 (array (list (symbol)))
 (array (number))
)

===============================================================================
struct
===============================================================================

#s(man name 'joe age 30)
#s(man)
#S(man)
#s(man name)
--------------------------------------------------------------------------------

(source
 (struct (symbol) (symbol) (quote (symbol)) (symbol) (number))
 (struct (symbol))
 (struct (symbol))
 (struct (symbol) (ERROR (symbol)))
)

===============================================================================
pathname
================================================================================

#p"hello"
#P""
#p"hello \"world\""
--------------------------------------------------------------------------------

(source
 (pathname (string))
 (pathname (string))
 (pathname (string))
)

